rust.org
# + OPTIONS: title:nil
# + OPTIONS: toc:nil
#+OPTIONS: num:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: ^:{}
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />

#+HTML_LINK_HOME: index.html
#+HTML_LINK_UP: knowledgebase.html

#+TITLE: > Rust
#+DESCRIPTION: google cloud platform notes

* Rust Basics
  
** Cargo
  
Cargo is a package manager, builder, test runner and document generator.

#+begin_src bash
cargo new hello
#+end_src

Will create a hello project, along with cargo.toml, which is the project
configuration.

#+begin_src bash
cargo run
#+end_src

Will compile the debug version by default, "--release" will produce the release
version without debugging symbols.

#+begin_src bash
cargo run --release
#+end_src


** Variables

Rust is a braced language, it end sentences with ; (semi-colon), it is also a
strongly typed language, but it can infer type variables based on the value:

#+begin_src
let a = 2;
let b: i32 = 2;
let (c,d) = (1,2)
#+end_src

Variables are immutable by default in rust, for safety, concurrency and speed,
but it can be declared as mutable too.

#+begin_src
let mut a = 0;
a = 1;
#+end_src

Constant variables are often uppercased, can be set out the module scope, e.g.:
global.

#+begin_src
const PI: f64 = 3.14;
#+end_src


** Scope

Variables can be shadowed, re-declared within a specific scope.

#+begin_src
fn main() {
  let x = 0;
  {
      let a = 1;
      println!("{}", a);
  }
}
#+end_src
   
Variables can be shadowed within the same scope, e.g.: change mutable variable
to immutable.

#+begin_src
let mut a = 0;
let a = 1;
#+end_src

Shadow variable with a diferent type value.

#+begin_src
let a = 0;
let a = "1";
#+end_src


** Memory Safey

It guarantees memory safety at compile time. This code guarantees that the
compiler will know that the variable was defined either way of the if-statement.

#+begin_src
let a: i32;
if true {
    a = 1;
} else {
    a = 0;
}
#+end_src


** Functions

Use snake_case for function names, functions don't need to be declared/defined
before its caller.

#+begin_src
fn fun(a: f64, b: f64) -> f64 {
    // return a + b
    a + b // "tail expression"
}
#+end_src

It doesn't support named arguments, one needs to provide all the arguments in
order.

It doesn't support variable number of arguments.

It doesn't support different types for the same arguments.

Macros ends with an exclamation point, e.g.: println!


** Module System

All items in a library are private by default.

hello/cargo.toml

hello/src/lib.rs
#+begin_src 
fn fun1() { println("fun1"); } // private
pub fn fun2() { println("func2"); } // public
#+end_src

hello/src/main.rs
#+begin_src
use hello::func2;
use std::collection::HashMap

fn main() {
    hello::fun1(); // error
    func2(): // ok
}
#+end_src

Check rust std API and crates.io for packages.

Adding packages in cargo.toml

#+begin_src
...
[dependencies]
package = "100.10.1"
#+end_src

Q: Same functions within the same module?, what's the scope?


** Scalar Types

There are four scalar types: integers, floats, booleas and characters.

*Integers*

unsigned u8, u16, ... u128, usize
signed i8, i16, ... i128, isize

Sizes cross-platform consistent, usize and isize represents the pointer platform
size (same bit number of the target platform), can hold memory addresses and
array indexes.

By default, i32 is set when the compiler infer the variable type.

No all integers are supported in all platforms, it depends on the platform
architecture, e.g.: 16 bits machines.

*Integers Literals*

- Decimal 10
- Hex 0x
- Octal 0o
- Binary 0b
- Byte (u8 only) b'A' (utf-char in ascii range)

These support underscores to readability.

*Floating*

f32 and f64 (default because it has more precision, slow on other architectures
e.g.: 32 bits.

Q: review single and double precision (check also IEEE-754)

Floating point literals, follows IEEE-754, no special sufixes required,
not valid: .1, valid: 0.1.

*Sufixes*

#+begin_src
let a: u16 = 1;
let b: f32 = 0.1;
#+end_src

same as

#+begin_src
let a = 1u16;
let b = 0.1f32;
#+end_src

same as

#+begin_src
let a = 1_u16;
let b = 0.1_f32;
#+end_src

this is useful to pass a numeric literal to a generic function that could
accept multiple numeric types.

*Boolean*

bool, true or false, are not integers, no arithmetic on them, unless to cast
them to some integers.

#+begin_src
true as u8
false as u8
#+end_src

*Character*

char, single unicode scalare value, any character, are 4 bytes (32 bits) long,
a char array  makes a UCS-4 or UTF-32 strings, literals are surrounded by single
quotes, strings are UTF-8 and characters are not, string do not used chars
internally, sources are UTF-8, so chars defined in a UTF-8 source file are going
to be UTF-8 strings and not really chars.


** Compound Types

*Tuples*

Multiple values of other and different types in one type.

#+begin_src 
let a = (1, "one")
let (c,d) = a
#+end_src

#+begin_src
let a: (u8, f63, i32) = (0, 0.1, 10)
let a1 = a.0
let a1 = a.1
#+end_src

Tuple has a max. arity of 12, more than that you can
still use the touple with limited functionality.

Arity, how many items of a touple has.

*Arrays*

Multiple values of the same type, arr are limited to 32 elements, above that
size it loose functionality, they live on the stack and are fixed size.

#+begin_src
let arr = [ 0, 0, 0 ];
let arr = [ 0; 3 ];
let arr: [u8; 3] = [ 0, 0, 0 ];
let a = arr[0]
#+end_src

*Vectors*

??


