rust.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-09 Sun 12:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&gt; Rust</title>
<meta name="generator" content="Org mode" />
<meta name="description" content="google cloud platform notes"
 />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="knowledgebase.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">&gt; Rust</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org562c0da">Rust Basics</a>
<ul>
<li><a href="#org5bbeac7">Cargo</a></li>
<li><a href="#org3427343">Variables</a></li>
<li><a href="#org02023ac">Scope</a></li>
<li><a href="#org1a96162">Memory Safey</a></li>
<li><a href="#orgd70410a">Functions</a></li>
<li><a href="#orge6c5020">Module System</a></li>
<li><a href="#org53d7032">Scalar Types</a></li>
<li><a href="#org77d8116">Compound Types</a></li>
<li><a href="#org0eb240c">Control Flows</a></li>
<li><a href="#org0cf34b9">Strings</a></li>
<li><a href="#org3f31fd3">Ownership</a></li>
<li><a href="#org6e9f755">References and Borrowing</a></li>
<li><a href="#org5c6580e">Structs</a></li>
<li><a href="#org8ff20d1">Traits</a></li>
<li><a href="#org33e87b9">Collections</a></li>
<li><a href="#orgd3c4a0d">Enums</a></li>
<li><a href="#org645f371">Closures</a></li>
<li><a href="#org1cd454e">Threads</a></li>
</ul>
</li>
<li><a href="#orgeced33f">Install</a></li>
<li><a href="#org3a18806">Other stuff</a>
<ul>
<li><a href="#orgc860a75">Others</a></li>
<li><a href="#org87d8bc1">Offtopic</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org562c0da" class="outline-2">
<h2 id="org562c0da">Rust Basics</h2>
<div class="outline-text-2" id="text-org562c0da">
</div>
<div id="outline-container-org5bbeac7" class="outline-3">
<h3 id="org5bbeac7">Cargo</h3>
<div class="outline-text-3" id="text-org5bbeac7">
<p>
Cargo is a package manager, builder, test runner and document generator.
</p>

<div class="org-src-container">
<pre class="src src-bash">cargo new hello
</pre>
</div>

<p>
Will create a hello project, along with cargo.toml, which is the project
configuration.
</p>

<div class="org-src-container">
<pre class="src src-bash">cargo run
</pre>
</div>

<p>
Will compile the debug version by default, "&#x2013;release" will produce the release
version without debugging symbols.
</p>

<div class="org-src-container">
<pre class="src src-bash">cargo run --release
</pre>
</div>
</div>
</div>


<div id="outline-container-org3427343" class="outline-3">
<h3 id="org3427343">Variables</h3>
<div class="outline-text-3" id="text-org3427343">
<p>
Rust is a braced language, it end sentences with ; (semi-colon), it is also a
strongly typed language, but it can infer type variables based on the value:
</p>

<pre class="example">
let a = 2;
let b: i32 = 2;
let (c,d) = (1,2)
</pre>

<p>
Variables are immutable by default in rust, for safety, concurrency and speed,
but it can be declared as mutable too.
</p>

<pre class="example">
let mut a = 0;
a = 1;
</pre>

<p>
Constant variables are often uppercased, can be set out the module scope, e.g.:
global.
</p>

<pre class="example">
const PI: f64 = 3.14;
</pre>
</div>
</div>


<div id="outline-container-org02023ac" class="outline-3">
<h3 id="org02023ac">Scope</h3>
<div class="outline-text-3" id="text-org02023ac">
<p>
Variables can be shadowed, re-declared within a specific scope.
</p>

<pre class="example">
fn main() {
  let x = 0;
  {
      let a = 1;
      println!("{}", a);
  }
}
</pre>

<p>
Variables can be shadowed within the same scope, e.g.: change mutable variable
to immutable.
</p>

<pre class="example">
let mut a = 0;
let a = 1;
</pre>

<p>
Shadow variable with a diferent type value.
</p>

<pre class="example">
let a = 0;
let a = "1";
</pre>
</div>
</div>


<div id="outline-container-org1a96162" class="outline-3">
<h3 id="org1a96162">Memory Safey</h3>
<div class="outline-text-3" id="text-org1a96162">
<p>
It guarantees memory safety at compile time. This code guarantees that the
compiler will know that the variable was defined either way of the if-statement.
</p>

<pre class="example">
let a: i32;
if true {
    a = 1;
} else {
    a = 0;
}
</pre>
</div>
</div>


<div id="outline-container-orgd70410a" class="outline-3">
<h3 id="orgd70410a">Functions</h3>
<div class="outline-text-3" id="text-orgd70410a">
<p>
Use snake_case for function names, functions don't need to be declared/defined
before its caller.
</p>

<pre class="example">
fn fun(a: f64, b: f64) -&gt; f64 {
    // return a + b
    a + b // "tail expression"
}
</pre>

<p>
It doesn't support named arguments, one needs to provide all the arguments in
order.
</p>

<p>
It doesn't support variable number of arguments.
</p>

<p>
It doesn't support different types for the same arguments.
</p>

<p>
Macros ends with an exclamation point, e.g.: println!
</p>
</div>
</div>


<div id="outline-container-orge6c5020" class="outline-3">
<h3 id="orge6c5020">Module System</h3>
<div class="outline-text-3" id="text-orge6c5020">
<p>
All items in a library are private by default.
</p>

<p>
hello/cargo.toml
</p>

<p>
hello/src/lib.rs
</p>
<pre class="example">
fn fun1() { println("fun1"); } // private
pub fn fun2() { println("func2"); } // public
</pre>

<p>
hello/src/main.rs
</p>
<pre class="example">
use hello::func2;
use std::collection::HashMap

fn main() {
    hello::fun1(); // error
    func2(): // ok
}
</pre>

<p>
Check rust std API and crates.io for packages.
</p>

<p>
Adding packages in cargo.toml
</p>

<pre class="example">
...
[dependencies]
package = "100.10.1"
</pre>

<p>
Q: Same functions within the same module?, what's the scope?
</p>
</div>
</div>


<div id="outline-container-org53d7032" class="outline-3">
<h3 id="org53d7032">Scalar Types</h3>
<div class="outline-text-3" id="text-org53d7032">
<p>
There are four scalar types: integers, floats, booleas and characters.
</p>

<p>
<b>Integers</b>
</p>

<p>
unsigned u8, u16, &#x2026; u128, usize
signed i8, i16, &#x2026; i128, isize
</p>

<p>
Sizes cross-platform consistent, usize and isize represents the pointer platform
size (same bit number of the target platform), can hold memory addresses and
array indexes.
</p>

<p>
By default, i32 is set when the compiler infer the variable type.
</p>

<p>
No all integers are supported in all platforms, it depends on the platform
architecture, e.g.: 16 bits machines.
</p>

<p>
<b>Integers Literals</b>
</p>

<ul class="org-ul">
<li>Decimal 10</li>
<li>Hex 0x</li>
<li>Octal 0o</li>
<li>Binary 0b</li>
<li>Byte (u8 only) b'A' (utf-char in ascii range)</li>
</ul>

<p>
These support underscores to readability.
</p>

<p>
<b>Floating</b>
</p>

<p>
f32 and f64 (default because it has more precision, slow on other architectures
e.g.: 32 bits.
</p>

<p>
Q: review single and double precision (check also IEEE-754)
</p>

<p>
Floating point literals, follows IEEE-754, no special sufixes required,
not valid: .1, valid: 0.1.
</p>

<p>
<b>Sufixes</b>
</p>

<pre class="example">
let a: u16 = 1;
let b: f32 = 0.1;
</pre>

<p>
same as
</p>

<pre class="example">
let a = 1u16;
let b = 0.1f32;
</pre>

<p>
same as
</p>

<pre class="example">
let a = 1_u16;
let b = 0.1_f32;
</pre>

<p>
this is useful to pass a numeric literal to a generic function that could
accept multiple numeric types.
</p>

<p>
<b>Boolean</b>
</p>

<p>
bool, true or false, are not integers, no arithmetic on them, unless to cast
them to some integers.
</p>

<pre class="example">
true as u8
false as u8
</pre>

<p>
<b>Character</b>
</p>

<p>
char, single unicode scalare value, any character, are 4 bytes (32 bits) long,
a char array  makes a UCS-4 or UTF-32 strings, literals are surrounded by single
quotes, strings are UTF-8 and characters are not, string do not used chars
internally, sources are UTF-8, so chars defined in a UTF-8 source file are going
to be UTF-8 strings and not really chars.
</p>
</div>
</div>


<div id="outline-container-org77d8116" class="outline-3">
<h3 id="org77d8116">Compound Types</h3>
<div class="outline-text-3" id="text-org77d8116">
<p>
<b>Tuples</b>
</p>

<p>
Multiple values of other and different types in one type.
</p>

<pre class="example">
let a = (1, "one")
let (c,d) = a
</pre>

<pre class="example">
let a: (u8, f63, i32) = (0, 0.1, 10)
let a1 = a.0
let a1 = a.1
</pre>

<p>
Tuple has a max. arity of 12, more than that you can
still use the touple with limited functionality.
</p>

<p>
Arity, how many items of a touple has.
</p>

<p>
<b>Arrays</b>
</p>

<p>
Multiple values of the same type, arr are limited to 32 elements, above that
size it loose functionality, they live on the stack and are fixed size.
</p>

<pre class="example">
let arr = [ 0, 0, 0 ];
let arr = [ 0; 3 ];
let arr: [u8; 3] = [ 0, 0, 0 ];
let a = arr[0]
</pre>

<p>
<b>Vectors</b>
</p>

<p>
??
</p>
</div>
</div>
