rust.org
** Control Flows

#+begin_src
if a == 0 {
     b = "zero";
} else if  a == 1 {
     b = "one";
} else {
     b = "other";
}
#+end_src

If's is an expression not an statement, expressions returns a value, statement
don't.

No semi-colon, it uses tail expresions to return the value and all the blocks
should return the same type, braces not optional.

#+begin_src
b = if a == 0 {
     "zero"
} else if  a == 1 {
     "one"
} else {
     "other"
};
#+end_src

*Loop*

Unconditional loops support labels:

#+begin_src
loop {
    break;
}
#+end_src

#+begin_src
'loop_a: loop {
    loop {
        // break 'loop_a;
        // continue 'loop_a;
    }
}
#+end_src

Rust doesn't coerce expressions to booleans.

#+begin_src 
while some_function() {
    // loop ends when some_function() evaluates to false
}
#+end_src

The code before, is sugar-sintax for:

#+begin_src
loop {
    if !some_function() { break }
    // some code...
}
#+end_src

An emulated do-while would be:

#+begin_src
loop {
    // some code...
    if !some_function() { break }
}
#+end_src

Rust iterates over any iterable value

#+begin_src
for a in [ 1, 2 ,3 ].iter() {
     // some code...
}
#+end_src

One can stack methods, like map, filter and fold, they will be lazy-evaluated.

Like python, it can destructure items and bind them to variables, e.g.:

#+begin_src
for (a, b) in [(0,1) (0,2)].iter() {
     // some code...
}
#+end_src

Ranges, e.g.:

#+begin_src
for a in 0..10 {
    // 0 to 9
    // some code...
}

for a in 0..=10 {
    // 0 to 10
    // some code...
}
#+end_src


** Strings

There's 6 types of string in the rust std library.

str, which is string-slice, &str is a borrowed string-slice, a literal string
is always a borrowed string-slice, e.g.: let a = "string";

&str, is often refered as string, the data can't be modified.

String, data can be modified.

#+begin_src
let somestr = "string".to_string(); // create a string from a borrowed string slice
let somestr = String::from("string");
#+end_src

- String, pointer to bytes, length and a capacity
- &str (borrowed string-slice) pointer to bytes and length, which can be seen
  as a subset of a String.

Both types are UTF-8.

Can't be index by character position, in favor to support different languages,
review UTF-8 and unicode.

Unicode scalars can be represented by 1, 2, 3 or 4 bytes, e.g.: graphemes.

One can index with:

#+begin_src
word.bytes() // vector of UTF-8 bytes, works ok with english-ascii
word.chars() // unicode scalars iterator
// unicode-segmentation // that return iterators that handle graphemes
//
// all of them constant access operations
#+end_src

There's a bunch of methos to handle strings, e.g. lines(), truncate(), etc.

Iterators provides the nth() method, which one can index.

Q: test let mut a: String, to check if the reference is mutable or is the cont.
Q: review UTF-8
Q: review unicode
Q: ascii


** Ownership

1. each value has an owner
2. one owner of a value, which can borrow the value
3. owner gets out of scope, value gets droped

#+begin_src
let a = String::from("string");
let b = a;
println("{}", a); // will produce an error since value is owned now by b
#+end_src

#+begin_src
let a = String::from("string"); // *ptr stored in heap, len/capacity in stack
let b = a.clone(); // copy, when only stack data is copied
#+end_src

In other languages, a clone is called a deep-copy.

When a value is droped, if there's a destructure, it's inmediatly executed:

1. Destructor
2. Free Heap
3. Pop Stack

Passing it to a function:

#+begin_src
let a = String::from("string");
fn func(a: String) {}
func(a); // now the function is the owner
println!("{}", a); // error, func is the "a" owner
#+end_src

One can do this to get back the ownership of the variable, not-ideal, check
reference and borrowing.

#+begin_src
let mut a = String::from("string");
fn func(a: String) -> String { a };
a = func(a)
#+end_src


** References and Borrowing

A referenc cannot outlive it's refered value, no reference to null is allowed.

Reference, "a" keeps the ownership, only reference of "a" is passed to the
function, it is like the ownership of the reference is passed to the function,
so when the function ends its execution, the reference it's droped, not the
value, which is like pointer.

#+begin_src
let a: String = String::from("string");
fn func(a: &String) {}
func(&a);
#+end_src

A reference is like a pointer to the variable, like c/c++.

A reference is always immutable, even though the variable is mutable, we can
make a mutable reference to a mutable value to change the value as well.

#+begin_src
let mut a: String = String::from("string");
func(&mut a);
fn func(a: &mut String) {
  a.insert_str(0, "..."); // the dot dereference automatically
  (*a).insert_str(0, "..."); // it dereference (manually)
  *a = String::from("replacing the string...");
}
#+end_src

- x: &mut i32, *x, it gives access to a mutable value
- x: &i32, *x, it gives access to an immutable value

It can only exists either, enforced by the compiler:

- 1 mutable reference
- N immutable references

Q: mutable reference to a immutable value?.


** Structs

In other languages you have classes, in rust we have structs.

Can have datafields, methods and associative functions.

#+begin_src
struct MyStruct {
    field1: bool,
    field2: u8,
}

// instantiate
// every single field needs a value
let mystruct = MyStruct {
    field1: true,
    field2: 1,
}
#+end_src

With a constructor, e.g.: to have default values.

#+begin_src
impl MyStruct {
    fn new() -> Self { // new is an associative function of the struct
        Self {
            field1: true,
            field2: 1,
        }
    }
}

let mystruct = MyStruct::new(); // invokes an associative function of the struct
let field1 = mystruct.field1;
mystruct.field2 = 0;
mystruct.func();
#+end_src

Methods can also be defined in the implementation block, e.g.:

#+begin_src
impl MyStruct {
   // associated function
   fn function() ...
   // methods
   fn move(self) ...
   fn borrow(&self) ...
   fn mut_borrow(&mut self) ...
}
#+end_src

Q: mutable in struct methods, self as a mutable?


