rust.html


<div id="outline-container-org0eb240c" class="outline-3">
<h3 id="org0eb240c">Control Flows</h3>
<div class="outline-text-3" id="text-org0eb240c">
<pre class="example">
if a == 0 {
     b = "zero";
} else if  a == 1 {
     b = "one";
} else {
     b = "other";
}
</pre>

<p>
If's is an expression not an statement, expressions returns a value, statement
don't.
</p>

<p>
No semi-colon, it uses tail expresions to return the value and all the blocks
should return the same type, braces not optional.
</p>

<pre class="example">
b = if a == 0 {
     "zero"
} else if  a == 1 {
     "one"
} else {
     "other"
};
</pre>

<p>
<b>Loop</b>
</p>

<p>
Unconditional loops support labels:
</p>

<pre class="example">
loop {
    break;
}
</pre>

<pre class="example">
'loop_a: loop {
    loop {
	// break 'loop_a;
	// continue 'loop_a;
    }
}
</pre>

<p>
Rust doesn't coerce expressions to booleans.
</p>

<pre class="example">
while some_function() {
    // loop ends when some_function() evaluates to false
}
</pre>

<p>
The code before, is sugar-sintax for:
</p>

<pre class="example">
loop {
    if !some_function() { break }
    // some code...
}
</pre>

<p>
An emulated do-while would be:
</p>

<pre class="example">
loop {
    // some code...
    if !some_function() { break }
}
</pre>

<p>
Rust iterates over any iterable value
</p>

<pre class="example">
for a in [ 1, 2 ,3 ].iter() {
     // some code...
}
</pre>

<p>
One can stack methods, like map, filter and fold, they will be lazy-evaluated.
</p>

<p>
Like python, it can destructure items and bind them to variables, e.g.:
</p>

<pre class="example">
for (a, b) in [(0,1) (0,2)].iter() {
     // some code...
}
</pre>

<p>
Ranges, e.g.:
</p>

<pre class="example">
for a in 0..10 {
    // 0 to 9
    // some code...
}

for a in 0..=10 {
    // 0 to 10
    // some code...
}
</pre>
</div>
</div>


<div id="outline-container-org0cf34b9" class="outline-3">
<h3 id="org0cf34b9">Strings</h3>
<div class="outline-text-3" id="text-org0cf34b9">
<p>
There's 6 types of string in the rust std library.
</p>

<p>
str, which is string-slice, &amp;str is a borrowed string-slice, a literal string
is always a borrowed string-slice, e.g.: let a = "string";
</p>

<p>
&amp;str, is often refered as string, the data can't be modified.
</p>

<p>
String, data can be modified.
</p>

<pre class="example">
let somestr = "string".to_string(); // create a string from a borrowed string slice
let somestr = String::from("string");
</pre>

<ul class="org-ul">
<li>String, pointer to bytes, length and a capacity</li>
<li>&amp;str (borrowed string-slice) pointer to bytes and length, which can be seen
as a subset of a String.</li>
</ul>

<p>
Both types are UTF-8.
</p>

<p>
Can't be index by character position, in favor to support different languages,
review UTF-8 and unicode.
</p>

<p>
Unicode scalars can be represented by 1, 2, 3 or 4 bytes, e.g.: graphemes.
</p>

<p>
One can index with:
</p>

<pre class="example">
word.bytes() // vector of UTF-8 bytes, works ok with english-ascii
word.chars() // unicode scalars iterator
// unicode-segmentation // that return iterators that handle graphemes
//
// all of them constant access operations
</pre>

<p>
There's a bunch of methos to handle strings, e.g. lines(), truncate(), etc.
</p>

<p>
Iterators provides the nth() method, which one can index.
</p>

<p>
Q: test let mut a: String, to check if the reference is mutable or is the cont.
Q: review UTF-8
Q: review unicode
Q: ascii
</p>
</div>
</div>


<div id="outline-container-org3f31fd3" class="outline-3">
<h3 id="org3f31fd3">Ownership</h3>
<div class="outline-text-3" id="text-org3f31fd3">
<ol class="org-ol">
<li>each value has an owner</li>
<li>one owner of a value, which can borrow the value</li>
<li>owner gets out of scope, value gets droped</li>
</ol>

<pre class="example">
let a = String::from("string");
let b = a;
println("{}", a); // will produce an error since value is owned now by b
</pre>

<pre class="example">
let a = String::from("string"); // *ptr stored in heap, len/capacity in stack
let b = a.clone(); // copy, when only stack data is copied
</pre>

<p>
In other languages, a clone is called a deep-copy.
</p>

<p>
When a value is droped, if there's a destructure, it's inmediatly executed:
</p>

<ol class="org-ol">
<li>Destructor</li>
<li>Free Heap</li>
<li>Pop Stack</li>
</ol>

<p>
Passing it to a function:
</p>

<pre class="example">
let a = String::from("string");
fn func(a: String) {}
func(a); // now the function is the owner
println!("{}", a); // error, func is the "a" owner
</pre>

<p>
One can do this to get back the ownership of the variable, not-ideal, check
reference and borrowing.
</p>

<pre class="example">
let mut a = String::from("string");
fn func(a: String) -&gt; String { a };
a = func(a)
</pre>
</div>
</div>


<div id="outline-container-org6e9f755" class="outline-3">
<h3 id="org6e9f755">References and Borrowing</h3>
<div class="outline-text-3" id="text-org6e9f755">
<p>
A referenc cannot outlive it's refered value, no reference to null is allowed.
</p>

<p>
Reference, "a" keeps the ownership, only reference of "a" is passed to the
function, it is like the ownership of the reference is passed to the function,
so when the function ends its execution, the reference it's droped, not the
value, which is like pointer.
</p>

<pre class="example">
let a: String = String::from("string");
fn func(a: &amp;String) {}
func(&amp;a);
</pre>

<p>
A reference is like a pointer to the variable, like c/c++.
</p>

<p>
A reference is always immutable, even though the variable is mutable, we can
make a mutable reference to a mutable value to change the value as well.
</p>

<pre class="example">
let mut a: String = String::from("string");
func(&amp;mut a);
fn func(a: &amp;mut String) {
  a.insert_str(0, "..."); // the dot dereference automatically
  (*a).insert_str(0, "..."); // it dereference (manually)
  *a = String::from("replacing the string...");
}
</pre>

<ul class="org-ul">
<li>x: &amp;mut i32, *x, it gives access to a mutable value</li>
<li>x: &amp;i32, *x, it gives access to an immutable value</li>
</ul>

<p>
It can only exists either, enforced by the compiler:
</p>

<ul class="org-ul">
<li>1 mutable reference</li>
<li>N immutable references</li>
</ul>

<p>
Q: mutable reference to a immutable value?.
</p>
</div>
</div>


<div id="outline-container-org5c6580e" class="outline-3">
<h3 id="org5c6580e">Structs</h3>
<div class="outline-text-3" id="text-org5c6580e">
<p>
In other languages you have classes, in rust we have structs.
</p>

<p>
Can have datafields, methods and associative functions.
</p>

<pre class="example">
struct MyStruct {
    field1: bool,
    field2: u8,
}

// instantiate
// every single field needs a value
let mystruct = MyStruct {
    field1: true,
    field2: 1,
}
</pre>

<p>
With a constructor, e.g.: to have default values.
</p>

<pre class="example">
impl MyStruct {
    fn new() -&gt; Self { // new is an associative function of the struct
	Self {
	    field1: true,
	    field2: 1,
	}
    }
}

let mystruct = MyStruct::new(); // invokes an associative function of the struct
let field1 = mystruct.field1;
mystruct.field2 = 0;
mystruct.func();
</pre>

<p>
Methods can also be defined in the implementation block, e.g.:
</p>

<pre class="example">
impl MyStruct {
   // associated function
   fn function() ...
   // methods
   fn move(self) ...
   fn borrow(&amp;self) ...
   fn mut_borrow(&amp;mut self) ...
}
</pre>

<p>
Q: mutable in struct methods, self as a mutable?
</p>
</div>
</div>
