rust.org
** Traits

Similar to interfaces in other languages, composition over inheritance.

#+begin_src
struct RedFox {
  enemy: bool,
  life: u32,
}

trait Noisy {
  fn get_noise(&self) -> &str;
}

impl Noise for RedFox {
  fn get_noise(&self) -> &str { "meow?" }
}
#+end_src

We could have implement the trait method in the struct directly, but if we use
traits:

- we can use generic functions that accept any values that implements the
  traits

#+begin_src
fn print_noise<T: Noisy>(item: T) {
  println!("{}", item.get_noise));
}
#+end_src

The above accepts a item type T, which is defined to be anything that implements
the Noisy trait, it can use any behaviour on item that the Noise trait defines.

So, we have a generic function that can take any timpoe as long it satisfies the
Noisy trait, this is like, in java:

#+begin_src
interface MyInterface {
   void a<ethod();
}

class MyClass implements MyInterface {
   public aMethod() { }; 
}

class Main {

   // this mimics what the trait in rust does.
   public static void example(MyInterface myInterface) {
       myInterface.aMethod();
   }

   public static void main(String args[]) {
       example(new MyClass());
   }
}
#+end_src

One can implement any trait on any struct, including any types or builtins, e.g.:

#+begin_src
impl Noisy for u8 {
  fn get_noise(&self) -> &str { "BYTE" }
}

fn main() {
  print_noise(5_u8); // prints bytes
}
#+end_src

There's a special trait called "copy", if the type implements copy, then
the type will be copied instead of moved in move situations, this make sense
o small values that fit on the stack, like small integers, booleans, etc..
implements copy. If the type uses heap, it cannot implement copy. You can opt-in
implementing copy with your own type if your type only uses other copy types.

Traits implement inheritance, and one can have default trait behavior, e.g.:

#+begin_src
trait Run {
  fn run(&self) {
    println!("I'm running");
  }
}

struct Robot {}
impl Run for Robot {}
#+end_src

No fields part of traits, set getter and setter methods on the traits as a
workaround.

Q: return references?
Q: know whether the memory is stored on the heap or in the stack.
Q: diamond pattern


** Collections

*Vectors*

Vec<T> of one type only, as any other language:

 #+begin_src 
let mut v: Vec<i32> = Vec::new();
v.push(1);
v.push(2);
let x = v.pop();
 #+end_src

 #+begin_src
// vec! mcros
let mut v = vec![ 1, 2, 3]
 #+end_src

*HashMap*

 #+begin_src
let mut h: HashMap<u8, bool> = HashMap::new();
h.insert(0, false);
h.insert(1, true);
let value = h.remove(&1).unwrap(); // returns an enum
 #+end_src

*Others*

- HashSet
- VecDeque
- LinkedList
- BinaryHeap
- BTreeSet
- BTreeMap

Q: add description
Q: other collections


** Enums

Enums in rust are more like algebraic data types in haskell than c-like enums.

#+begin_src
enum Color {
  Red,
  Green,
  Blue,
}

let color = Color::Red;
#+end_src

Real power, data and method related to variants.

#+begin_src 
enum DispenserItem {
  Empty,
  Ammo(u8),
  Things(String, i32),
  Place { x: i32, y: i32 }
}

// one can implement functions and methods for an enum
impl DispenserItem {
  fn display(&self) { }
}

let item = DispenserItem::Things("thing", 1);
#+end_src

Generic enums:

#+begin_src
// to handle nulls...
enum Option<T> {
  Some(T),
  None,
}
#+end_src

Patterns:

#+begin_src
if let Some(x) = my_variable {
  println!("value is {}", x); // only executed if Some(x) is true
}

// better to handle multiple matches
match my_variable {
  Some(x) => {
    // print..
  },
  None => {
    // print..
  }
}

// _ => {} // will match anything, default or anything else branch
#+end_src

#+begin_src
let x = match my_variable {
  Some(x) => x.squared() + 1,
  None => 42,
}; // notice the semi-colon at the end, since it's an expression
#+end_src

*Special Enums*

*Options*

Prelude, std library always in the scope by default.

let mut x = None; // or Option<i32> = None;
x = Some(5); // will infer the datatype
x.is_some(); // true
x.is_none(); // false
for i in x {
  // print i // will print 5
}

Q: add link to the official documentation;

*Result*

#+begin_src
#[must_use] // annotation makes it a compiler warning to silently drop a result
enum Result<T, E> {
  Ok(T),
  Err(E),
}
#+end_src

Used a lot in I/O operations.

#+begin_src
use std::fs::File;

fn main() {
  let res = File::open("foo");
  let f = res.unwrap(); // ok, return file, err, crashes
  lef f = res.except("there's some error"); // same as unwrap, add message in case of crash

  if res.is_ok() {
    let f = res.unwrap();
  }

  // pattern matching
  match res {
    Ok(f) => { ... },
    Err(e) => { ... },
  }
}
#+end_src


** Closures

Closer, functional program, iterators, spawn a thread, etc.

A closure is an anonymous function that can borrow or capture some data from the
scope it is nested.

#+begin_src
let add = |x, y| { x + y }
|| {} // empty closure
#+end_src

Will borrow references, e.g.:

#+begin_src
let s = "s".to_string();
let f = || { ... print s... }
f(); // prints "s"
#+end_src

This is ok, if the clouse will not outlive the variable that is referencing
but the compiler wont let us send this to another thread because another thread
might live longer than this thread.

Closure supports move semantics, we can force the closure to move any variable
it uses into and take ownership of them, so we can move the closure to another
thread.

Closure example:

#+begin_src
let mut v = vec![ 1, 2, 3 ];

v.iter()
  .map( |x| x * 3)
  .filer( |x| *x > 10)
  .fold(0, |acc, x| acc + x); // folds a structure into a value
#+end_src


** Threads

Threads are portable, will work in Linux, MacOs, etc..

#+begin_src
use std::thread;
let handle = thread::spawn(move || {
  // do something...
});
handle.joint.unwrap();
#+end_src

Use async/await while waiting network or disk I/O.

Q: review async/await
Q: mutex?
Q: barriers?
Q: futures?
Q: shared mem?
Q: a mroe extensive tutorial...


* Install

Reference: https://www.rust-lang.org/tools/install

#+begin_src
curl --proto '=https' --tlsv1.2 -sSf https://sh.rustup.rs | sh
#+end_src

Append:

#+begin_src
export PATH=$HOME/.cargo/bin:$PATH
#+end_src

* Other stuff

** Others

- #[derive(Debug))] // what is this shit.
- (&mut self: Self) // to edit the value of self?? test this.
- exceptions ?
- dyn :??

** Offtopic

Q: iterators v/s indexed
Q: refence (c++) v/s bind (python) 
Q: https://doc.rust-lang.org/book/ch19-01-unsafe-rust.html
