rust.html


<div id="outline-container-org8ff20d1" class="outline-3">
<h3 id="org8ff20d1">Traits</h3>
<div class="outline-text-3" id="text-org8ff20d1">
<p>
Similar to interfaces in other languages, composition over inheritance.
</p>

<pre class="example">
struct RedFox {
  enemy: bool,
  life: u32,
}

trait Noisy {
  fn get_noise(&amp;self) -&gt; &amp;str;
}

impl Noise for RedFox {
  fn get_noise(&amp;self) -&gt; &amp;str { "meow?" }
}
</pre>

<p>
We could have implement the trait method in the struct directly, but if we use
traits:
</p>

<ul class="org-ul">
<li>we can use generic functions that accept any values that implements the
traits</li>
</ul>

<pre class="example">
fn print_noise&lt;T: Noisy&gt;(item: T) {
  println!("{}", item.get_noise));
}
</pre>

<p>
The above accepts a item type T, which is defined to be anything that implements
the Noisy trait, it can use any behaviour on item that the Noise trait defines.
</p>

<p>
So, we have a generic function that can take any timpoe as long it satisfies the
Noisy trait, this is like, in java:
</p>

<pre class="example">
interface MyInterface {
   void a&lt;ethod();
}

class MyClass implements MyInterface {
   public aMethod() { }; 
}

class Main {

   // this mimics what the trait in rust does.
   public static void example(MyInterface myInterface) {
       myInterface.aMethod();
   }

   public static void main(String args[]) {
       example(new MyClass());
   }
}
</pre>

<p>
One can implement any trait on any struct, including any types or builtins, e.g.:
</p>

<pre class="example">
impl Noisy for u8 {
  fn get_noise(&amp;self) -&gt; &amp;str { "BYTE" }
}

fn main() {
  print_noise(5_u8); // prints bytes
}
</pre>

<p>
There's a special trait called "copy", if the type implements copy, then
the type will be copied instead of moved in move situations, this make sense
o small values that fit on the stack, like small integers, booleans, etc..
implements copy. If the type uses heap, it cannot implement copy. You can opt-in
implementing copy with your own type if your type only uses other copy types.
</p>

<p>
Traits implement inheritance, and one can have default trait behavior, e.g.:
</p>

<pre class="example">
trait Run {
  fn run(&amp;self) {
    println!("I'm running");
  }
}

struct Robot {}
impl Run for Robot {}
</pre>

<p>
No fields part of traits, set getter and setter methods on the traits as a
workaround.
</p>

<p>
Q: return references?
Q: know whether the memory is stored on the heap or in the stack.
Q: diamond pattern
</p>
</div>
</div>


<div id="outline-container-org33e87b9" class="outline-3">
<h3 id="org33e87b9">Collections</h3>
<div class="outline-text-3" id="text-org33e87b9">
<p>
<b>Vectors</b>
</p>

<p>
Vec&lt;T&gt; of one type only, as any other language:
</p>

<pre class="example">
let mut v: Vec&lt;i32&gt; = Vec::new();
v.push(1);
v.push(2);
let x = v.pop();
</pre>

<pre class="example">
// vec! mcros
let mut v = vec![ 1, 2, 3]
</pre>

<p>
<b>HashMap</b>
</p>

<pre class="example">
let mut h: HashMap&lt;u8, bool&gt; = HashMap::new();
h.insert(0, false);
h.insert(1, true);
let value = h.remove(&amp;1).unwrap(); // returns an enum
</pre>

<p>
<b>Others</b>
</p>

<ul class="org-ul">
<li>HashSet</li>
<li>VecDeque</li>
<li>LinkedList</li>
<li>BinaryHeap</li>
<li>BTreeSet</li>
<li>BTreeMap</li>
</ul>

<p>
Q: add description
Q: other collections
</p>
</div>
</div>


<div id="outline-container-orgd3c4a0d" class="outline-3">
<h3 id="orgd3c4a0d">Enums</h3>
<div class="outline-text-3" id="text-orgd3c4a0d">
<p>
Enums in rust are more like algebraic data types in haskell than c-like enums.
</p>

<pre class="example">
enum Color {
  Red,
  Green,
  Blue,
}

let color = Color::Red;
</pre>

<p>
Real power, data and method related to variants.
</p>

<pre class="example">
enum DispenserItem {
  Empty,
  Ammo(u8),
  Things(String, i32),
  Place { x: i32, y: i32 }
}

// one can implement functions and methods for an enum
impl DispenserItem {
  fn display(&amp;self) { }
}

let item = DispenserItem::Things("thing", 1);
</pre>

<p>
Generic enums:
</p>

<pre class="example">
// to handle nulls...
enum Option&lt;T&gt; {
  Some(T),
  None,
}
</pre>

<p>
Patterns:
</p>

<pre class="example">
if let Some(x) = my_variable {
  println!("value is {}", x); // only executed if Some(x) is true
}

// better to handle multiple matches
match my_variable {
  Some(x) =&gt; {
    // print..
  },
  None =&gt; {
    // print..
  }
}

// _ =&gt; {} // will match anything, default or anything else branch
</pre>

<pre class="example">
let x = match my_variable {
  Some(x) =&gt; x.squared() + 1,
  None =&gt; 42,
}; // notice the semi-colon at the end, since it's an expression
</pre>

<p>
<b>Special Enums</b>
</p>

<p>
<b>Options</b>
</p>

<p>
Prelude, std library always in the scope by default.
</p>

<p>
let mut x = None; <i>/ or Option&lt;i32&gt; = None;
x = Some(5); /</i> will infer the datatype
x.is_some(); <i>/ true
x.is_none(); /</i> false
for i in x {
  <i>/ print i /</i> will print 5
}
</p>

<p>
Q: add link to the official documentation;
</p>

<p>
<b>Result</b>
</p>

<pre class="example">
#[must_use] // annotation makes it a compiler warning to silently drop a result
enum Result&lt;T, E&gt; {
  Ok(T),
  Err(E),
}
</pre>

<p>
Used a lot in I/O operations.
</p>

<pre class="example">
use std::fs::File;

fn main() {
  let res = File::open("foo");
  let f = res.unwrap(); // ok, return file, err, crashes
  lef f = res.except("there's some error"); // same as unwrap, add message in case of crash

  if res.is_ok() {
    let f = res.unwrap();
  }

  // pattern matching
  match res {
    Ok(f) =&gt; { ... },
    Err(e) =&gt; { ... },
  }
}
</pre>
</div>
</div>


<div id="outline-container-org645f371" class="outline-3">
<h3 id="org645f371">Closures</h3>
<div class="outline-text-3" id="text-org645f371">
<p>
Closer, functional program, iterators, spawn a thread, etc.
</p>

<p>
A closure is an anonymous function that can borrow or capture some data from the
scope it is nested.
</p>

<pre class="example">
let add = |x, y| { x + y }
|| {} // empty closure
</pre>

<p>
Will borrow references, e.g.:
</p>

<pre class="example">
let s = "s".to_string();
let f = || { ... print s... }
f(); // prints "s"
</pre>

<p>
This is ok, if the clouse will not outlive the variable that is referencing
but the compiler wont let us send this to another thread because another thread
might live longer than this thread.
</p>

<p>
Closure supports move semantics, we can force the closure to move any variable
it uses into and take ownership of them, so we can move the closure to another
thread.
</p>

<p>
Closure example:
</p>

<pre class="example">
let mut v = vec![ 1, 2, 3 ];

v.iter()
  .map( |x| x * 3)
  .filer( |x| *x &gt; 10)
  .fold(0, |acc, x| acc + x); // folds a structure into a value
</pre>
</div>
</div>


<div id="outline-container-org1cd454e" class="outline-3">
<h3 id="org1cd454e">Threads</h3>
<div class="outline-text-3" id="text-org1cd454e">
<p>
Threads are portable, will work in Linux, MacOs, etc..
</p>

<pre class="example">
use std::thread;
let handle = thread::spawn(move || {
  // do something...
});
handle.joint.unwrap();
</pre>

<p>
Use async/await while waiting network or disk I/O.
</p>

<p>
Q: review async/await
Q: mutex?
Q: barriers?
Q: futures?
Q: shared mem?
Q: a mroe extensive tutorial&#x2026;
</p>
</div>
</div>
</div>


<div id="outline-container-orgeced33f" class="outline-2">
<h2 id="orgeced33f">Install</h2>
<div class="outline-text-2" id="text-orgeced33f">
<p>
Reference: <a href="https://www.rust-lang.org/tools/install">https://www.rust-lang.org/tools/install</a>
</p>

<pre class="example">
curl --proto '=https' --tlsv1.2 -sSf https://sh.rustup.rs | sh
</pre>

<p>
Append:
</p>

<pre class="example">
export PATH=$HOME/.cargo/bin:$PATH
</pre>
</div>
</div>

<div id="outline-container-org3a18806" class="outline-2">
<h2 id="org3a18806">Other stuff</h2>
<div class="outline-text-2" id="text-org3a18806">
</div>
<div id="outline-container-orgc860a75" class="outline-3">
<h3 id="orgc860a75">Others</h3>
<div class="outline-text-3" id="text-orgc860a75">
<ul class="org-ul">
<li>#[derive(Debug))] // what is this shit.</li>
<li>(&amp;mut self: Self) // to edit the value of self?? test this.</li>
<li>exceptions ?</li>
<li>dyn :??</li>
</ul>
</div>
</div>

<div id="outline-container-org87d8bc1" class="outline-3">
<h3 id="org87d8bc1">Offtopic</h3>
<div class="outline-text-3" id="text-org87d8bc1">
<p>
Q: iterators v/s indexed
Q: refence (c++) v/s bind (python) 
Q: <a href="https://doc.rust-lang.org/book/ch19-01-unsafe-rust.html">https://doc.rust-lang.org/book/ch19-01-unsafe-rust.html</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
